# 이미지 blur 처리 page 111
# filter 2d() 메소드 사용

import cv2
# utils에 파일을 만들어서 사용한다.
from utils import image_show
import numpy as np

# 이미지 경로 
image_path = "./cat.png"

# 이미지 일기 처리
image = cv2.imread(image_path)
# print(image)
'''
print(image) -> 출력 결과
[[252 248 247]
  [251 247 246]
  [252 248 247]
  ...
  [253 250 246]
  [254 249 246]
  [254 249 246]]]
'''
# 커널 생성 처리
kernel = np.ones((10, 10)) /25.0 # 모두 더하면 1이 되도록 정규화
image_kernel = cv2.filter2D(image, -1, kernel) # 인자값은 이렇게 넣어준다.
# print(kernel)
'''
print(kernel) -> 출력 결과
[[0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04]
 [0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04]
 [0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04]
 [0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04]
 [0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04]
 [0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04]
 [0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04]
 [0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04]
 [0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04]
 [0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04 0.04]]
'''
image_show(image_kernel)